<h2 style = "color : Brown"> Data Frame </h2>

In [1]:
# All imports
#import numpy as np
import pandas as pd

<h4 style = "color : Sky blue"> Example - 1</h4>  

##### Create a Data Frame cars using raw data stored in a dictionary

In [2]:
cars_per_cap = [809, 731, 588, 18, 200, 70, 45]
country = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
drives_right = [True, False, False, False, True, True, True]

In [3]:
data = {"cars_per_cap": cars_per_cap, "country": country, "drives_right": drives_right}

In [4]:
data

{'cars_per_cap': [809, 731, 588, 18, 200, 70, 45],
 'country': ['United States',
  'Australia',
  'Japan',
  'India',
  'Russia',
  'Morocco',
  'Egypt'],
 'drives_right': [True, False, False, False, True, True, True]}

In [5]:
cars = pd.DataFrame(data)

In [6]:
cars

   cars_per_cap        country  drives_right
0           809  United States          True
1           731      Australia         False
2           588          Japan         False
3            18          India         False
4           200         Russia          True
5            70        Morocco          True
6            45          Egypt          True

In [7]:
type(cars)

pandas.core.frame.DataFrame

<h4 style = "color : Sky blue"> Example - 2 (Reading data from a file)</h4>  

##### Create a Data Frame by importing cars data from cars.csv

In [9]:
# Read a file using pandas

cars_df = pd.read_csv('cars.csv')
cars_df

    USCA   US United States    809  FALSE
0  ASPAC  AUS     Australia  731.0   True
1  ASPAC  JAP         Japan  588.0   True
2  ASPAC   IN         India   18.0   True
3  ASPAC   RU        Russia  200.0  False
4  LATAM  MOR       Morocco   70.0  False
5    AFR   EG         Egypt   45.0  False
6    EUR  ENG       England    NaN   True

<h4 style = "color : Sky blue"> Example - 3 (Column headers)</h4>  

##### Read file - skip header

In [10]:
cars_df = pd.read_csv('cars.csv', header=None)
cars_df

       0    1              2      3      4
0   USCA   US  United States  809.0  False
1  ASPAC  AUS      Australia  731.0   True
2  ASPAC  JAP          Japan  588.0   True
3  ASPAC   IN          India   18.0   True
4  ASPAC   RU         Russia  200.0  False
5  LATAM  MOR        Morocco   70.0  False
6    AFR   EG          Egypt   45.0  False
7    EUR  ENG        England    NaN   True

##### Assign Headers

In [2]:
# Returns an array of headers

In [11]:
# Rename Headers

cars_df.columns = ['country code', 'region', 'country', 'cars_per_cap', 'drives_right']
cars_df

  country code region        country  cars_per_cap  drives_right
0         USCA     US  United States         809.0         False
1        ASPAC    AUS      Australia         731.0          True
2        ASPAC    JAP          Japan         588.0          True
3        ASPAC     IN          India          18.0          True
4        ASPAC     RU         Russia         200.0         False
5        LATAM    MOR        Morocco          70.0         False
6          AFR     EG          Egypt          45.0         False
7          EUR    ENG        England           NaN          True

In [13]:
cars_df.rename(columns={'country':'countries'}, inplace=True)
cars_df

  country code region      countries  cars_per_cap  drives_right
0         USCA     US  United States         809.0         False
1        ASPAC    AUS      Australia         731.0          True
2        ASPAC    JAP          Japan         588.0          True
3        ASPAC     IN          India          18.0          True
4        ASPAC     RU         Russia         200.0         False
5        LATAM    MOR        Morocco          70.0         False
6          AFR     EG          Egypt          45.0         False
7          EUR    ENG        England           NaN          True

<h4 style = "color : Sky blue"> Example - 4 (Row index/names) </h4>  

##### Read file - skip header and assign first column as index.

In [14]:
# Index is returned by
cars_df.index

RangeIndex(start=0, stop=8, step=1)

In [16]:
# Read file and set 1st column as index
cars_df = pd.read_csv("cars.csv", header = None, index_col=0)

In [17]:
# Print the new index
cars_df.columns = ['region','country','cars_per_cap','drives_right']

In [18]:
cars_df

      region        country  cars_per_cap  drives_right
0
USCA      US  United States         809.0         False
ASPAC    AUS      Australia         731.0          True
ASPAC    JAP          Japan         588.0          True
ASPAC     IN          India          18.0          True
ASPAC     RU         Russia         200.0         False
LATAM    MOR        Morocco          70.0         False
AFR       EG          Egypt          45.0         False
EUR      ENG        England           NaN          True